[LANGUAGE]
APPLY=应用
OK=确定
CANCEL=取消
MESSAGE_TITLE_PROMPT=提示
SERVER_STATUS_DISCONNECTED=与服务器的连接已经断开！
YES=是
NO=否
CLOSE=关闭
EXIT=退出
ADD=添加
[ERROR_CODE]
//错误代码
ERR_NO						= 成功登录

//系统类或网络类错误代码
ERR_SYS_PROTOCOL			= 通讯协议版本不匹配
ERR_SYS_UNKNOWN				= 未知错误
ERR_SYS_COMMAND				= 协议命令错误
ERR_SYS_DATABASE			= 数据库错误
ERR_SYS_NETWORK				= 网络断开(网络通路断开)
ERR_SYS_SERVERTYPE			= 服务器类型错误, 登录到错误类型的服务器

//即时通讯类错误代码
ERR_IMS_PROTOCOL			= 通讯协议版本不匹配
ERR_IMS_INVALIDACCOUNT		= 无效的帐户(系统没有该帐户ID)
ERR_IMS_INVALIDPASSWORD		= 无效的密码
ERR_IMS_DUPLICATELOGIN		= 该帐户已经登录, 不得重复登录
ERR_IMS_REQUESTRELOGIN		= 服务器要求使用获得的新地址重新登录
ERR_IMS_KICKOUT				= 被踢出(该帐户在其它地方已登录, 强制本地帐号退出)
ERR_IMS_MODULELIMIT			= 服务器功能限制(服务端即时通讯模块授权没有启用)
ERR_IMS_CONNECTLIMIT		= 连接服务器到达最大用户数限制
ERR_IMS_ACCOUNTLIMIT		= 用户登录到达最大用户帐号数限制
ERR_IMS_SERVER				= 用户帐号在该服务器上不存在或该服务器没有加载帐号验证模块
ERR_IMS_SERVERLIMIT			= 服务器地址限定, 该用户不能在此服务器上登录
ERR_IMS_UNKNOWNAUTHTYPE		= 未知的帐户验证模式(NOT:DB/LDAP/RADIUS)
ERR_IMS_FORBIDDEN			= 该帐户被禁用
ERR_IMS_CLIENTAUTH			= 请求客户端验证
ERR_IMS_SERIALNOERROR		= 序列号绑定错误
ERR_IMS_INVALIDRECORD		= 非录像服务器帐户错误
ERR_IMS_INVALIDIDENTIFYID	= 终端识别码错误

//会议通讯类错误代码
ERR_MMS_PROTOCOL			= 通讯协议版本不匹配
ERR_MMS_INVALIDPASSWORD		= 无效的会议密码
ERR_MMS_ALREADYLOGIN		= 该帐户已经进入会议
ERR_MMS_WORKGROUPLIMITS		= 会议已经超过六人限制
ERR_MMS_NOMCU				= 会议没有适当的MCU服务器
ERR_MMS_OWNERLEAVED			= 会议所有者离开会议
ERR_MMS_ROOMLOCKED			= 会议已经锁定
ERR_MMS_INVALIDROOMTYPE		= 会议室类型不明确
ERR_MMS_INVALIDMEMBERTYPE	= 登录者类型不明确
ERR_MMS_LOSSINVALID			= 定损报案号不存在
ERR_MMS_LOSSAGAIN			= 定损报案号已被其他人登记
ERR_MMS_LOSSHAVEEND			= 定损报案号已经定损结束
ERR_MMS_MODULELIMIT			= 服务器功能限制(系统会议模块授权没有启用)
ERR_MMS_CONNECTLIMIT		= 系统到达最大会议成员数限制
ERR_MMS_HAVETV				= 电视墙设备号已存在
ERR_MMS_INVALIDTV			= 非有效的电视墙设备号
ERR_MMS_HAVETVMATRIX		= 电视墙矩阵设备号已存在
ERR_MMS_INVALIDTVMATRIX		= 非有效的电视墙矩阵设备号
ERR_MMS_SERVER				= 会议服务器断开连接
ERR_MMS_AUDITORLIMIT		= 会议旁听者最大数量限制

//短信类错误代码
ERR_SMS_PROTOCOL			= 通讯协议版本不匹配
ERR_SMS_GATEWAY				= 短信网关发送失败
ERR_SMS_INVALIDSEARIALNO	= 序列号码为空或无效
ERR_SMS_NETWORK				= 连接到短信网关发生网络故障
ERR_SMS_OTHERS				= 连接到短信网关发生其他故障
ERR_SMS_ENTRYLIMITS			= 手机号码为空或者超过1000个
ERR_SMS_SPLITCHAR			= 手机号码分割符号不正确
ERR_SMS_ERRORNUMBER			= 部分手机号码不正确，已删除，其余手机号码被发送
ERR_SMS_CONTENTOVERFLOW		= 短信内容为空或超长(70个汉字)
ERR_SMS_BILLING				= 短信网关计费失败
ERR_SMS_UNKNOWN				= 未知错误
ERR_SMS_MODULELIMIT			= 服务器功能限制(系统短信模块授权没有启用)
ERR_SMS_INVALIDTYPE			= 短信类型未定义
ERR_SMS_EMPTYCODE			= 发送号或接收号为空

//监控类类错误代码
ERR_MON_PROTOCOL			= 通讯协议版本不匹配
ERR_MON_REUSESERIAL			= 序列号已被其他帐户绑定
ERR_MON_INVALIDACCOUNT		= 无效的监控设备(或网关)帐户(系统没有该帐户ID)
ERR_MON_INVALIDPASSWORD		= 无效的密码
ERR_MON_INVALIDSERIAL		= 无效的序列号
ERR_MON_ALREADYLOGIN		= 已经登录
ERR_MON_INVALIDTYPE			= 非法的终端类型
ERR_MON_MODULELIMIT			= 服务器功能限制(系统监控模块授权没有启用)
ERR_MON_CONNECTLIMIT		= 系统到达最大通道数限制

//离线文件类错误代码
ERR_NDS_PROTOCOL			= 通讯协议版本不匹配
ERR_NDS_MCUDISKFULL			= MCU磁盘满
ERR_NDS_RECEIVERSPACEFULL	= 接收者空间满
ERR_NDS_MD5					= MD5验证失败
ERR_NDS_FILENOTEXIST		= 文件不存在
ERR_NDS_FILEISUPLOADING		= 文件正在上传中
ERR_NDS_FILEISDOWNLOADING	= 文件正在下载中
ERR_NDS_NETERROR			= 网络错误

[SERVER_CONNECTIONSTATE]
SERVER_CONNECTING	= 正在连接
SERVER_RECONNECTED	= 已重新连接
SERVER_BUSY			= 服务器忙
SERVER_FAILED		= 连接失败
SERVER_DISCONNECTED	= 连接断开
SERVER_CONNECTED	= 已连接